{"add":{"path":"part-00001-7a0bdac7-455c-42e3-ba4e-372296d1d8bd-c000.snappy.parquet","partitionValues":{},"size":173199,"modificationTime":1734211082160,"dataChange":true,"stats":"{\"numRecords\":200,\"minValues\":{\"file_content\":\"Member:  Hi, I'm calling about a denied claim I received. My name is Emily Wilson, and my member ID is MEM456789. I was expecting coverage for a recent medical service, but the denial letter said it's not covered under my policy.\\n\\nCustomer Support:  I'm happy to help you with that, Emily. Can you please confirm the date of service and the type of service you received?\\nMember:  It was on January 10th, and it was for physical therapy. I've had this service covered before, but I recently switched to a new policy. I thought this new policy would cover it.\\nCustomer Support:  I understand. Let me check on that for you. Can you please hold for just a moment?\\nMember:  Okay, that's fine. Thank you.\\nCustomer Support:  Thank you for holding, Emily. I've checked on your policy, and it appears that your new policy does indeed cover physical therapy. However, it looks like the update didn't get reflected in our system, which is why your claim was denied.\\nMember:  Oh, that makes sense. So, what can be done to fix this?\\nCustomer Support:  I'm going to go ahead and connect you with our claims team, and they'll work on getting your claim reprocessed under your new policy. You should receive an update within the next 24 to 48 hours.\\nMember:  That sounds great, thank you so much! I really appreciate your help.\\nCustomer Support:  You're welcome, Emily. Is there anything else I can assist you with today?\\nMember:  No, that's all. Thank you again.\\nCustomer Support:  You're welcome. We'll take care of the rest. Have a great day!\\nMember:  You too, bye.\\nCustomer Support:  Bye, Emily.\\nElapsed Time: 9 minutes\",\"actions\":\"{\\\"actionItems\\\": [{\\\"actionItem\\\": \\\"\\\", \\\"dueDate\\\": \\\"\\\", \\\"notes\\\": \\\"\\\", \\\"owner\\\": \\\"\\\", \\\"status\\\": \\\"\\\"}]}\",\"sentiment\":\"negative\",\"file_name\":\"transcript_0.txt\"},\"maxValues\":{\"file_content\":\"Member: Hi, my name is Emily Wilson and my member ID is MEM456789. I'm calling about a claim that was denied. I received a letter stating that my policy doesn't cover the service, but I'm certain that it should be covered under my new policy.\\n\\nCustomer Support: I apologize for the inconvenience, Emily. Can you please provide me with more information about the claim and the service that was denied?\\nMember: Yes, of course. The claim was for a dental procedure that I had last month. I had switched to a new policy in January, and according to the policy documents, this type of procedure should be covered.\\nCustomer Support: I understand. Can you please hold for just a moment while I check on the status of your claim?\\n Member: Sure, thank you.\\nCustomer Support: Emily, I've checked on the status of your claim, and it appears that our system still has your old policy information on file. It looks like the update to your new policy hasn't been processed yet.\\nMember: That makes sense. I did switch policies recently. Can you please update the system and reprocess the claim?\\nCustomer Support: I'd be happy to help you with that, Emily. However, I need to escalate this issue to our claims team to get the claim reprocessed. They will review the information and get back to you within the next 24-48 hours.\\nMember: Okay, that sounds good. Can you please give me a reference number or something so I can follow up on the status of the claim?\\nCustomer Support: Yes, of course. Your reference number is #CAS-012345. You can use this number to track the status of your claim. We'll also send you a follow-up email with the updated information.\\nMember: Great, thank you so much for your help. I appreciate it.\\nCustomer Support: You're welcome, Emily. I apologize again for the inconvenience and appreciate your patience. We'll get this resolved for you as soon as possible.\\nMember: Thank you again. I'll wait to hear back from the claims team.\\nCustomer Support: You're welcome, Emily. Have a great day!\\n(Minute 9)\",\"file_name\":\"transcript_99.txt\",\"sentiment\":\"positive\",\"actions\":\"{'action_items': []}\"},\"nullCount\":{\"file_name\":0,\"sentiment\":0,\"actions\":0,\"file_content\":0}}","tags":null,"deletionVector":null,"baseRowId":null,"defaultRowCommitVersion":null,"clusteringProvider":null}}
{"remove":{"path":"part-00001-33e642ac-89c7-4698-bc2c-d3c830438ad6-c000.snappy.parquet","dataChange":true,"deletionTimestamp":1734211082161,"extendedFileMetadata":true,"partitionValues":{},"size":161247}}
{"commitInfo":{"timestamp":1734211082161,"operation":"WRITE","operationParameters":{"mode":"Overwrite"},"clientVersion":"delta-rs.0.22.3","operationMetrics":{"execution_time_ms":12,"num_added_files":1,"num_added_rows":200,"num_partitions":0,"num_removed_files":1}}}