{"protocol":{"minReaderVersion":1,"minWriterVersion":2}}
{"metaData":{"id":"a70f51aa-8fa6-4176-89af-728a9d429fe5","name":null,"description":null,"format":{"provider":"parquet","options":{}},"schemaString":"{\"type\":\"struct\",\"fields\":[{\"name\":\"file_name\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"file_content\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"sentiment\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}},{\"name\":\"actions\",\"type\":\"string\",\"nullable\":true,\"metadata\":{}}]}","partitionColumns":[],"createdTime":1734206375619,"configuration":{}}}
{"add":{"path":"part-00001-735470d1-add0-409f-87d4-b1b3ac256f1e-c000.snappy.parquet","partitionValues":{},"size":18392,"modificationTime":1734206375627,"dataChange":true,"stats":"{\"numRecords\":10,\"minValues\":{\"actions\":\"{\\\"actionItems\\\": [{\\\"actionItem\\\": \\\"\\\", \\\"dueDate\\\": \\\"\\\", \\\"notes\\\": \\\"\\\", \\\"owner\\\": \\\"\\\", \\\"status\\\": \\\"\\\"}]}\",\"file_name\":\"transcript_0.txt\",\"sentiment\":\"\",\"file_content\":\"Member: Hi, I'd like to schedule an appointment with a specialist. My member ID is MEM123456.\\n\\nCustomer Support: Thank you for calling us, MEM123456. Can you please tell me what type of specialist you're looking for and what date and time you'd prefer for the appointment?\\nMember: I'm looking for a dermatologist and I was thinking maybe next Wednesday or Thursday. Do you have any availability?\\nCustomer Support: Let me check our schedule. (pause) Okay, I've checked and we have a few options available for next Wednesday and Thursday. We have Dr. Smith available on Wednesday at 2 PM and Dr. Johnson available on Thursday at 10 AM. Both are highly rated specialists in dermatology. Which one would you prefer?\\nMember: That sounds great. Can you tell me a bit more about Dr. Smith and Dr. Johnson? What are their specialties within dermatology?\\nCustomer Support: Dr. Smith specializes in skin cancer treatment and cosmetic dermatology, while Dr. Johnson focuses on acne treatment and skin allergies. Both are highly experienced and well-reviewed by our members.\\nMember: Okay, I think I'd like to schedule an appointment with Dr. Johnson on Thursday at 10 AM.\\nCustomer Support: Great choice! I've scheduled the appointment for you. You'll receive a confirmation email with all the details. Is there anything else I can assist you with today?\\nMember: No, that's all. Thank you for your help!\\nCustomer Support: You're welcome, MEM123456. Have a great day and we'll see you on Thursday!\\nMember: Thanks, bye.\\nCustomer Support: Bye.\"},\"maxValues\":{\"file_content\":\"Member: Hi, I'm trying to register and log in to my online service account, but I'm having some trouble. My member ID is MEM123456.\\n\\nTechnical Support: Hi there, sorry to hear that you're having issues. Can you tell me more about the problem you're experiencing with your account? What error message are you seeing?\\nMember: Well, when I try to log in, it says my username and password are incorrect, but I'm sure I'm entering the right information.\\nTechnical Support: Okay, let's try to troubleshoot this. Can you try resetting your password? Sometimes, it's just a simple password issue.\\nMember: I've already tried that. I've reset my password multiple times, but it still won't let me log in.\\nTechnical Support: Alright, let's try something else. Can you check if your account is locked out? Sometimes, if you enter the wrong password too many times, your account gets locked for security reasons.\\nMember: How do I check that?\\nTechnical Support: You can try calling our automated system to check the status of your account. I can give you the number to call.\\nMember: Okay, that sounds good.\\nTechnical Support: The number is 1-800-123-4567. You can call that number and follow the prompts to check the status of your account.\\nMember: Okay, I'll try that. But what if my account is locked out? How do I unlock it?\\nTechnical Support: If your account is locked out, you'll need to contact our customer support team during business hours to have it unlocked. I can also escalate this issue for you, but I need to know more information about your account.\\nMember: Okay, I'll call the automated system and see what it says. If it's locked out, I'll call back during business hours to get it unlocked.\\nTechnical Support: Sounds good. I apologize again for the inconvenience. If you have any other questions or need further assistance, feel free to call back.\\nMember: Thanks for your help. I'll call back if I need anything else.\\nTechnical Support: You're welcome. Have a great day.\",\"file_name\":\"transcript_9.txt\",\"actions\":\"{\\\"actionItems\\\": [{\\\"actionItem\\\": \\\"\\\", \\\"dueDate\\\": \\\"\\\", \\\"notes\\\": \\\"\\\", \\\"owner\\\": \\\"\\\", \\\"status\\\": \\\"\\\"}]}\",\"sentiment\":\"\"},\"nullCount\":{\"file_name\":0,\"sentiment\":0,\"actions\":0,\"file_content\":0}}","tags":null,"deletionVector":null,"baseRowId":null,"defaultRowCommitVersion":null,"clusteringProvider":null}}
{"commitInfo":{"timestamp":1734206375628,"operation":"WRITE","operationParameters":{"mode":"Overwrite"},"operationMetrics":{"execution_time_ms":9,"num_added_files":1,"num_added_rows":10,"num_partitions":0,"num_removed_files":0},"clientVersion":"delta-rs.0.22.3"}}